testsrc/main/mondrian/xmla/error/Execute07.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <Foo>Have a nice day</Foo>
  </Header>
  <Body>
    <Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
      <Command>
        <Statement>
SELECT {[Customers].[All Customers].[USA].[CA].[Berkeley]} ON 0,
{[Time].[1997]} ON 1,
{[Product].[All Products].[Drink]} ON 2
DRILLTHROUGH MAXROWS 1000 FIRSTROWSET 200
FROM Sales
        </Statement>
      </Command>
      <Properties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DataSourceInfo>MondrianFoodMart</DataSourceInfo>
        </PropertyList>
      </Properties>
    </Execute>
  </Body>
</Envelope>
